package homeworks.streams;

//уровень 10
public class Tasks4 {

    /**
     * Задача 1: Найти k-ую перестановку из n элементов
     *
     * Дано число n и число k, необходимо найти k-ую перестановку из n элементов.
     * Решение можно осуществить с помощью Stream API, комбинируя операции map, filter и reduce.
     */

//    private static void m41() {
//        int n = 5;
//
//    }
//
//    /**
//     * Задача 2: Разбить список на подсписки заданного размера
//     *
//     * Дан список элементов и размер подсписков. Необходимо разбить список
//     * на подсписки указанного размера. Решение можно осуществить
//     * с помощью Stream API, используя методы map, collect и groupingBy.
//     */
//
//    private static void m411() {
//        List<Integer> list = Arrays.asList(1, 2, 3, 4, 5, 6, 7, 8, 9);
//
//    }

    /**
     * Дан список сотрудников, у каждого из которых есть поле "salary".
     * Необходимо найти среднюю зарплату сотрудников, работающих на должности "developer"
     * в компаниях, которые находятся в городах, начинающихся на букву "M".
     */

//    private static void m4113() {
//
//    }
}
